```
resource "ibm_is_instance" "testacc_instance" {
  name    = "tfp-test-instance"
  image   = "r006-bbf1406e-6780-4c7b-85e4-7258ae2cd21f"
  profile = "cx2-2x4"
  primary_network_interface {
    subnet = "0717-dd24c727-cb58-43a2-8f72-c44d2a35a1e7"
  }
  user_data = "a"
  vpc       = "r006-91cc28f4-c5bf-43ae-a6c8-689a7a600505"
  zone      = "us-south-1"
  keys      = ["r006-e93168aa-c0fa-4992-b7e5-a2db3bc5a159"]
  boot_volume {
    size    = 250
    profile = "sdp"
    iops    = 10000
    allowed_use {}
    # allowed_use = ""
  }
  volume_prototypes {
    name                             = "proto1"
    delete_volume_on_instance_delete = true
    volume_name                      = "proto1"
    volume_capacity                  = 141
    volume_profile                   = "sdp"
    # allowed_use = ""
    allowed_use {}
  }
  ```
  
```
sunitha@Sunithas-MacBook-Pro terraform % tfa

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # ibm_is_instance.testacc_instance will be created
  + resource "ibm_is_instance" "testacc_instance" {
      + access_tags                       = (known after apply)
      + availability_policy_host_failure  = (known after apply)
      + bandwidth                         = (known after apply)
      + cluster_network                   = (known after apply)
      + confidential_compute_mode         = (known after apply)
      + crn                               = (known after apply)
      + default_trusted_profile_auto_link = (known after apply)
      + disks                             = (known after apply)
      + enable_secure_boot                = (known after apply)
      + force_action                      = false
      + gpu                               = (known after apply)
      + health_reasons                    = (known after apply)
      + health_state                      = (known after apply)
      + id                                = (known after apply)
      + image                             = "r006-bbf1406e-6780-4c7b-85e4-7258ae2cd21f"
      + keys                              = [
          + "r006-e93168aa-c0fa-4992-b7e5-a2db3bc5a159",
        ]
      + lifecycle_reasons                 = (known after apply)
      + lifecycle_state                   = (known after apply)
      + memory                            = (known after apply)
      + metadata_service_enabled          = (known after apply)
      + name                              = "tfp-test-instance"
      + numa_count                        = (known after apply)
      + placement_target                  = (known after apply)
      + profile                           = "cx2-2x4"
      + reservation                       = (known after apply)
      + resource_controller_url           = (known after apply)
      + resource_crn                      = (known after apply)
      + resource_group                    = (known after apply)
      + resource_group_name               = (known after apply)
      + resource_name                     = (known after apply)
      + resource_status                   = (known after apply)
      + status                            = (known after apply)
      + status_reasons                    = (known after apply)
      + tags                              = (known after apply)
      + total_network_bandwidth           = (known after apply)
      + total_volume_bandwidth            = (known after apply)
      + user_data                         = "a"
      + volume_attachments                = (known after apply)
      + volume_bandwidth_qos_mode         = (known after apply)
      + vpc                               = "r006-91cc28f4-c5bf-43ae-a6c8-689a7a600505"
      + wait_before_delete                = true
      + zone                              = "us-south-1"

      + boot_volume {
          + auto_delete_volume = true
          + bandwidth          = (known after apply)
          + encryption         = (known after apply)
          + iops               = 10000
          + name               = (known after apply)
          + profile            = "sdp"
          + size               = 250
          + snapshot           = (known after apply)
          + snapshot_crn       = (known after apply)
          + tags               = (known after apply)
          + volume_id          = (known after apply)

          + allowed_use {
              + api_version       = (known after apply)
              + bare_metal_server = (known after apply)
              + instance          = (known after apply)
            }
        }

      + cluster_network_attachments {
          + href          = (known after apply)
          + id            = (known after apply)
          + name          = (known after apply)
          + resource_type = (known after apply)

          + cluster_network_interface {
              + auto_delete = (known after apply)
              + href        = (known after apply)
              + id          = (known after apply)
              + name        = (known after apply)

              + primary_ip {
                  + address     = (known after apply)
                  + auto_delete = (known after apply)
                  + href        = (known after apply)
                  + id          = (known after apply)
                  + name        = (known after apply)
                }

              + subnet {
                  + href = (known after apply)
                  + id   = (known after apply)
                }
            }
        }

      + metadata_service {
          + enabled            = (known after apply)
          + protocol           = (known after apply)
          + response_hop_limit = (known after apply)
        }

      + network_attachments {
          + deleted       = (known after apply)
          + href          = (known after apply)
          + id            = (known after apply)
          + name          = (known after apply)
          + primary_ip    = (known after apply)
          + resource_type = (known after apply)

          + virtual_network_interface {
              + allow_ip_spoofing             = (known after apply)
              + auto_delete                   = (known after apply)
              + crn                           = (known after apply)
              + enable_infrastructure_nat     = (known after apply)
              + id                            = (known after apply)
              + name                          = (known after apply)
              + protocol_state_filtering_mode = (known after apply)
              + resource_group                = (known after apply)
              + resource_type                 = (known after apply)
              + security_groups               = (known after apply)
              + subnet                        = (known after apply)

              + ips {
                  + address       = (known after apply)
                  + auto_delete   = (known after apply)
                  + deleted       = (known after apply)
                  + href          = (known after apply)
                  + name          = (known after apply)
                  + reserved_ip   = (known after apply)
                  + resource_type = (known after apply)
                }

              + primary_ip {
                  + address       = (known after apply)
                  + auto_delete   = (known after apply)
                  + deleted       = (known after apply)
                  + href          = (known after apply)
                  + name          = (known after apply)
                  + reserved_ip   = (known after apply)
                  + resource_type = (known after apply)
                }
            }
        }

      + network_interfaces {
          + allow_ip_spoofing    = (known after apply)
          + id                   = (known after apply)
          + name                 = (known after apply)
          + primary_ipv4_address = (known after apply)
          + security_groups      = (known after apply)
          + subnet               = (known after apply)

          + primary_ip {
              + address       = (known after apply)
              + auto_delete   = (known after apply)
              + href          = (known after apply)
              + name          = (known after apply)
              + reserved_ip   = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + primary_network_interface {
          + allow_ip_spoofing    = false
          + id                   = (known after apply)
          + name                 = (known after apply)
          + port_speed           = (known after apply)
          + primary_ipv4_address = (known after apply)
          + security_groups      = (known after apply)
          + subnet               = "0717-dd24c727-cb58-43a2-8f72-c44d2a35a1e7"

          + primary_ip {
              + address       = (known after apply)
              + auto_delete   = (known after apply)
              + href          = (known after apply)
              + name          = (known after apply)
              + reserved_ip   = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + reservation_affinity {
          + policy = (known after apply)

          + pool {
              + crn           = (known after apply)
              + deleted       = (known after apply)
              + href          = (known after apply)
              + id            = (known after apply)
              + name          = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + vcpu {
          + architecture = (known after apply)
          + burst        = (known after apply)
          + count        = (known after apply)
          + manufacturer = (known after apply)
          + percentage   = (known after apply)
        }

      + volume_prototypes {
          + delete_volume_on_instance_delete = true
          + id                               = (known after apply)
          + name                             = "proto1"
          + volume_bandwidth                 = (known after apply)
          + volume_capacity                  = 141
          + volume_crn                       = (known after apply)
          + volume_encryption_key            = (known after apply)
          + volume_id                        = (known after apply)
          + volume_iops                      = (known after apply)
          + volume_name                      = "proto1"
          + volume_profile                   = "sdp"
          + volume_resource_type             = (known after apply)
          + volume_source_snapshot           = (known after apply)
          + volume_tags                      = (known after apply)

          + allowed_use {
              + api_version       = (known after apply)
              + bare_metal_server = (known after apply)
              + instance          = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
ibm_is_instance.testacc_instance: Creating...
ibm_is_instance.testacc_instance: Still creating... [10s elapsed]
ibm_is_instance.testacc_instance: Still creating... [20s elapsed]
ibm_is_instance.testacc_instance: Still creating... [30s elapsed]
ibm_is_instance.testacc_instance: Creation complete after 34s [id=0717_ab301894-b640-48da-8c00-b4745c48e713]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

```
terraform show
# ibm_is_instance.testacc_instance:
resource "ibm_is_instance" "testacc_instance" {
    access_tags                      = []
    availability_policy_host_failure = "restart"
    bandwidth                        = 4000
    cluster_network                  = []
    confidential_compute_mode        = "disabled"
    crn                              = "crn:v1:bluemix:public:is:us-south-1:a/7f75c7b025e54bc5635f754b2f888665::instance:0717_ab301894-b640-48da-8c00-b4745c48e713"
    disks                            = []
    enable_secure_boot               = false
    force_action                     = false
    gpu                              = []
    health_reasons                   = []
    health_state                     = "ok"
    id                               = "0717_ab301894-b640-48da-8c00-b4745c48e713"
    image                            = "r006-bbf1406e-6780-4c7b-85e4-7258ae2cd21f"
    keys                             = [
        "r006-e93168aa-c0fa-4992-b7e5-a2db3bc5a159",
    ]
    lifecycle_reasons                = []
    lifecycle_state                  = "stable"
    memory                           = 4
    metadata_service_enabled         = false
    name                             = "tfp-test-instance"
    numa_count                       = 1
    placement_target                 = []
    profile                          = "cx2-2x4"
    reservation                      = []
    resource_controller_url          = "https://cloud.ibm.com/vpc-ext/compute/vs"
    resource_crn                     = "crn:v1:bluemix:public:is:us-south-1:a/7f75c7b025e54bc5635f754b2f888665::instance:0717_ab301894-b640-48da-8c00-b4745c48e713"
    resource_group                   = "bdd96715c2a44f2bb60df4ff14a543f5"
    resource_group_name              = "Default"
    resource_name                    = "tfp-test-instance"
    resource_status                  = "running"
    status                           = "running"
    status_reasons                   = []
    tags                             = []
    total_network_bandwidth          = 3000
    total_volume_bandwidth           = 1000
    user_data                        = "a"
    volume_attachments               = [
        {
            id          = "0717-57c6cebd-d4a6-4314-b953-25082ef7d68c"
            name        = "lark-upon-sixteen-scarily"
            volume_crn  = "crn:v1:bluemix:public:is:us-south-1:a/7f75c7b025e54bc5635f754b2f888665::volume:r006-69a9c0c1-515f-47b8-852c-1f85886b9875"
            volume_id   = "r006-69a9c0c1-515f-47b8-852c-1f85886b9875"
            volume_name = "unvisited-pureness-strainer-overreach"
        },
        {
            id          = "0717-ae98fa70-f39b-44e3-b11e-c20b25cad780"
            name        = "proto1"
            volume_crn  = "crn:v1:bluemix:public:is:us-south-1:a/7f75c7b025e54bc5635f754b2f888665::volume:r006-525e6e76-7455-450b-9b1f-04be871f908b"
            volume_id   = "r006-525e6e76-7455-450b-9b1f-04be871f908b"
            volume_name = "proto1"
        },
    ]
    volume_bandwidth_qos_mode        = "weighted"
    vpc                              = "r006-91cc28f4-c5bf-43ae-a6c8-689a7a600505"
    wait_before_delete               = true
    zone                             = "us-south-1"

    boot_volume {
        auto_delete_volume = true
        bandwidth          = 1000
        iops               = 10000
        name               = "unvisited-pureness-strainer-overreach"
        profile            = "sdp"
        size               = 250
        tags               = []
        volume_id          = "r006-69a9c0c1-515f-47b8-852c-1f85886b9875"

        allowed_use {
            api_version       = "2019-08-23"
            bare_metal_server = "true"
            instance          = "true"
        }
    }

    metadata_service {
        enabled            = false
        protocol           = "http"
        response_hop_limit = 1
    }

    primary_network_interface {
        allow_ip_spoofing    = false
        id                   = "0717-f18a691b-ac5e-45ea-801a-6c775873134f"
        name                 = "skimming-nearness-obtain-slot"
        port_speed           = 3000
        primary_ipv4_address = "10.240.0.4"
        security_groups      = [
            "r006-414d2a79-4c03-47a7-acb1-e262ea6f6ee0",
        ]
        subnet               = "0717-dd24c727-cb58-43a2-8f72-c44d2a35a1e7"

        primary_ip {
            address       = "10.240.0.4"
            auto_delete   = true
            href          = "https://us-south.iaas.cloud.ibm.com/v1/subnets/0717-dd24c727-cb58-43a2-8f72-c44d2a35a1e7/reserved_ips/0717-e4c83dc1-0261-4779-954d-44b64c3efc59"
            name          = "lens-outtakes-molecular-casino"
            reserved_ip   = "0717-e4c83dc1-0261-4779-954d-44b64c3efc59"
            resource_type = "subnet_reserved_ip"
        }
    }

    reservation_affinity {
        policy = "automatic"
    }

    vcpu {
        architecture = "amd64"
        burst        = []
        count        = 2
        manufacturer = "intel"
        percentage   = 100
    }

    volume_prototypes {
        delete_volume_on_instance_delete = true
        id                               = "0717-ae98fa70-f39b-44e3-b11e-c20b25cad780"
        name                             = "proto1"
        volume_bandwidth                 = 1000
        volume_capacity                  = 141
        volume_crn                       = "crn:v1:bluemix:public:is:us-south-1:a/7f75c7b025e54bc5635f754b2f888665::volume:r006-525e6e76-7455-450b-9b1f-04be871f908b"
        volume_id                        = "r006-525e6e76-7455-450b-9b1f-04be871f908b"
        volume_iops                      = 3000
        volume_name                      = "proto1"
        volume_profile                   = "sdp"
        volume_resource_type             = "volume"
        volume_tags                      = []
    }
}
```